import 'dart:math';

class DuaaModel {
  final String text;
  final int id;

  DuaaModel({required this.id, required this.text});
}

DuaaModel getRandomDuaa() {
  final randomIndex = Random().nextInt(duaaList.length);
  return duaaList[randomIndex];
}

List<DuaaModel> duaaList = [
  DuaaModel(id: 0, text: 'اللهم انصر اهل غزة'),
  DuaaModel(id: 1, text: 'اللهم احرس أهل غزة بعينك التي لا تنام'),
  DuaaModel(id: 2, text: 'اللهم حرر المسجد الأقصى'),
  DuaaModel(id: 3, text: 'اللهم بردًا وسلامًا على أهل غزة'),
  DuaaModel(
      id: 4,
      text:
          'اللهم بحق عينك التي لا تنام وعزك الذي لا يُضام أرنا عجائب قدرتك في نصرهم'),
  DuaaModel(id: 5, text: 'اللهُم كُن لأهل غزة عوناً ونصيراً يا رب العالمين'),
  DuaaModel(
      id: 6,
      text:
          'اللهم بارك جهاد المجاهدين في غزة و فلسطين، وأيدهم بجنودك ونصرك يا قوي يا كريم'),
  DuaaModel(
      id: 7,
      text:
          'اللهم نستودعك أهالي غزّة وفلسطين فانصرهم واحفظهم بعينك التي لا تنام، واربط على قلوبهم وأمدهم بجُندك وأنزل عليهم سكينتك وسخر لهم الأرض ومن عليها'),
  DuaaModel(
      id: 8,
      text:
          'اللهم انصر إخواننا المجاهدين في غزة وفلسطين، اللهم كن لهم ولا تكن عليهم'),
  DuaaModel(
      id: 9,
      text: 'اللهم اجعل نار أعدائهم عليهم برداً وسلاماً يا أرحم الرّاحمين'),
  DuaaModel(
      id: 10,
      text:
          'اللهم انصرهم، وارزقهم القوة والصبر، واربط على قلوبهم، وأنزل عليهم من رحماتك'),
  DuaaModel(
      id: 11,
      text:
          'اللهم حرر فلسطين، والمسجد الأقصى من كيد المعتدين، وكن يا الله عوناً لإخواننا في فلسطين'),
  DuaaModel(id: 12, text: 'اللهم داوِ جرحاهم، واشف مرضاهم، وتقبّل موتاهم'),
  DuaaModel(
      id: 13,
      text:
          'اللهم اجعل للمرابطين النّصرة والعزّة والغلبة والقوة والهيبة في قلوب أعدائهم يا أكرم الأكرمين'),
  DuaaModel(
      id: 14,
      text:
          'اللهم رد عن أهل فلسطين وغزة كيد إسرائيل وفل حدها وأزل دولتها واذهب عن أرضك سلطانها ولا تدع لها سبيلاً على أحد من عبادك المؤمنين'),
  DuaaModel(id: 15, text: 'اللهم سدد رميهم وانصرنا على الصهاينة'),
  DuaaModel(id: 16, text: 'اللهم احمي الأقصى يا أرحم الراحمين'),
  DuaaModel(
      id: 17,
      text: 'اللهم أطعمهم من جوع وآمنهم من خوف وانصرهم علي القوم الظالمين'),
  DuaaModel(id: 18, text: 'يا رب يا مغيث اغثهم وسدد رميهم'),
];
